Revit 2026 API

# FailuresAccessorIsElementsDeletionPermitted(IListElementId, String) Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsElementsDeletionPermitted(
	IList<ElementId> idsToDelete,
	out string reason
)
```
```vb
Public Function IsElementsDeletionPermitted (
	idsToDelete As IList(Of ElementId),
	<OutAttribute> ByRef reason As String
) As Boolean
```
```cpp
public:
bool IsElementsDeletionPermitted(
	IList<ElementId^>^ idsToDelete,
	[OutAttribute] String^% reason
)
```
```fsharp
member IsElementsDeletionPermitted :
        idsToDelete : IList<ElementId> *
        reason : string byref -> bool
```

#### Parameters

idsToDelete IListElementId

reason String

#### Return Value

Boolean

#### Reference

FailuresAccessor Class

IsElementsDeletionPermitted Overload

Autodesk.Revit.DB Namespace